aws/amazon-freertos/vendors/st/boards/stm32l475_discovery/ports/common_io/iot_i2c.c
/*
 * FreeRTOS Common IO V0.1.1
 * Copyright (C) 2020 Amazon.com, Inc. or its affiliates.  All Rights Reserved.
 *
 * Permission is hereby granted, free of charge, to any person obtaining a copy of
 * this software and associated documentation files (the "Software"), to deal in
 * the Software without restriction, including without limitation the rights to
 * use, copy, modify, merge, publish, distribute, sublicense, and/or sell copies of
 * the Software, and to permit persons to whom the Software is furnished to do so,
 * subject to the following conditions:
 *
 * The above copyright notice and this permission notice shall be included in all
 * copies or substantial portions of the Software.
 *
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY, FITNESS
 * FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR
 * COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER
 * IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN
 * CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.
 *
 * http://aws.amazon.com/freertos
 * http://www.FreeRTOS.org
 */

/**
 * @file iot_i2c.c
 * @brief HAL i2c implementation on STM32L4 Discovery Board
 */

/* The config header is always included first. */
#include "iot_config.h"

/* ST Board includes. */
#include "stm32l4xx_hal.h"
#include "stm32l4xx_hal_i2c.h"
#include "stm32l475e_iot01.h"

/* Main includes. */
#include "iot_i2c.h"

/* FreeRTOS includes. */
#include "semphr.h"

/* Total number of I2C instances on this ST microcontroller. */
#define _I2C_INSTANCE_NUM       ( 3 )

/* Used by the "flags" member of IotI2CDescriptor_t. */
#define _FLAG_OPENED            ( 0x01 ) /* If the instance is already opened. */
#define _FLAG_SLAVE_ADDRESS     ( 0x02 ) /* If the slave address has been set. */
#define _FLAG_NO_STOP           ( 0x04 ) /* If the no stop has been requested. */

/* Initializer of the "flags" member of IotI2CDescriptor_t. */
#define _FLAG_INITIALIZER       ( 0 )

/* Initial state if slave address is unset. */
#define _UNSET_SLAVE_ADDRESS    ( 0xFFFFU )

/* Read or write operation. */
#define _I2C_READ_OP            ( 0 )
#define _I2C_WRITE_OP           ( 1 )

/* Read or write operation. */
#define _I2C_SYNC_OP            ( 0 )
#define _I2C_ASYNC_OP           ( 1 )

/* First bit: Tx busy; Second bit: Rx busy */
#define _I2C_STATE_BUSY_MASK    ( 0x3 )

/* Calculate the address of IotI2CDescriptor_t from the address of its 'xHandle'. */
#define _toDescriptor( pHandle )                 ( ( IotI2CDescriptor_t * ) ( ( uint8_t * ) pHandle - offsetof( IotI2CDescriptor_t, xHandle ) ) )

/* Helper macro function to check if a specific flag is set or not. */
#define _isFlagSet( pI2cDescriptor, flag )       ( ( ( pI2cDescriptor )->flags & ( flag ) ) > 0 )
#define _isFlagNotSet( pI2cDescriptor, flag )    ( ( ( pI2cDescriptor )->flags & ( flag ) ) == 0 )

typedef struct IotI2CDescriptor
{
    I2C_HandleTypeDef xHandle;     /* ST Handle */
    IotI2CConfig_t xConfig;        /* Bus Configuration */
    IotI2CCallback_t xCallback;    /* Callback function */
    void * pvUserContext;          /* User context passed in callback */
    SemaphoreHandle_t xSemphr;
    uint16_t usSlaveAddr;          /* Slave Address */
    uint16_t usTransmittedTxBytes; /* Number of Transmitted Bytes */
    uint16_t usReceivedRxBytes;    /* Number of Received Bytes */
    uint8_t flags;                 /* Bit flags to tract different states. */
} IotI2CDescriptor_t;

static IotI2CDescriptor_t _i2cContexts[ _I2C_INSTANCE_NUM ] =
{
    {
        .xHandle =
        {
            .Instance             = I2C1,
            .Init.Timing          = DISCOVERY_I2Cx_TIMING,
            .Init.OwnAddress1     = 0,
            .Init.AddressingMode  = I2C_ADDRESSINGMODE_7BIT,
            .Init.DualAddressMode = I2C_DUALADDRESS_DISABLE,
            .Init.OwnAddress2     = 0,
            .Init.GeneralCallMode = I2C_GENERALCALL_DISABLE,
            .Init.NoStretchMode   = I2C_NOSTRETCH_DISABLE,
        },
        .xConfig ={ 0            },
        .xSemphr = NULL,
        .usSlaveAddr = _UNSET_SLAVE_ADDRESS,
        .usTransmittedTxBytes = 0,
        .usReceivedRxBytes = 0,
        .flags = _FLAG_INITIALIZER
    },

    {
        .xHandle =
        {
            .Instance             = I2C2,
            .Init.Timing          = DISCOVERY_I2Cx_TIMING,
            .Init.OwnAddress1     = 0,
            .Init.AddressingMode  = I2C_ADDRESSINGMODE_7BIT,
            .Init.DualAddressMode = I2C_DUALADDRESS_DISABLE,
            .Init.OwnAddress2     = 0,
            .Init.GeneralCallMode = I2C_GENERALCALL_DISABLE,
            .Init.NoStretchMode   = I2C_NOSTRETCH_DISABLE,
        },
        .xConfig ={ 0            },
        .xSemphr = NULL,
        .usSlaveAddr = _UNSET_SLAVE_ADDRESS,
        .usTransmittedTxBytes = 0,
        .usReceivedRxBytes = 0,
        .flags = _FLAG_INITIALIZER
    },

    {
        .xHandle =
        {
            .Instance             = I2C3,
            .Init.Timing          = DISCOVERY_I2Cx_TIMING,
            .Init.OwnAddress1     = 0,
            .Init.AddressingMode  = I2C_ADDRESSINGMODE_7BIT,
            .Init.DualAddressMode = I2C_DUALADDRESS_DISABLE,
            .Init.OwnAddress2     = 0,
            .Init.GeneralCallMode = I2C_GENERALCALL_DISABLE,
            .Init.NoStretchMode   = I2C_NOSTRETCH_DISABLE,
        },
        .xConfig ={ 0            },
        .xSemphr = NULL,
        .usSlaveAddr = _UNSET_SLAVE_ADDRESS,
        .usTransmittedTxBytes = 0,
        .usReceivedRxBytes = 0,
        .flags = _FLAG_INITIALIZER
    }
};



/*---------------------Private functions---------------------*/

static int32_t _toI2cStatus( HAL_StatusTypeDef halStatus,
                             uint8_t operation );

static int32_t _doMasterTransfer( IotI2CDescriptor_t * pI2cDescriptor,
                                  uint8_t * const pucBuffer,
                                  size_t xBytes,
                                  HAL_StatusTypeDef ( * pMasterSync )( I2C_HandleTypeDef * hi2c,
                                                                       uint16_t DevAddress,
                                                                       uint8_t * pData,
                                                                       uint16_t Size,
                                                                       uint32_t Timeout ),
                                  HAL_StatusTypeDef ( * pMasterIT )( I2C_HandleTypeDef * hi2c,
                                                                     uint16_t DevAddress,
                                                                     uint8_t * pData,
                                                                     uint16_t Size ),
                                  HAL_StatusTypeDef ( * pMasterSequentialIT )( I2C_HandleTypeDef * hi2c,
                                                                               uint16_t DevAddress,
                                                                               uint8_t * pData,
                                                                               uint16_t Size,
                                                                               uint32_t XferOptions ) );

