aws/amazon-freertos/vendors/st/boards/stm32l475_discovery/ports/common_io/iot_i2c.c
/*--------------------API Implementation---------------------*/

IotI2CHandle_t iot_i2c_open( int32_t lI2CInstance )
{
    /* Exceeded maximum instance number. */
    if( lI2CInstance >= _I2C_INSTANCE_NUM )
    {
        return NULL;
    }

    IotI2CDescriptor_t * pI2cDescriptor = &_i2cContexts[ lI2CInstance ];
    I2C_HandleTypeDef * pHalHandle = &( pI2cDescriptor->xHandle );
    HAL_StatusTypeDef halStatus = HAL_OK;

    /* Not opened yet. */
    if( _isFlagNotSet( pI2cDescriptor, _FLAG_OPENED ) )
    {
        halStatus = HAL_I2C_Init( pHalHandle );

        if( halStatus == HAL_OK )
        {
            /* Configure Analog filter. */
            halStatus = HAL_I2CEx_ConfigAnalogFilter( pHalHandle, I2C_ANALOGFILTER_ENABLE );
        }

        if( halStatus == HAL_OK )
        {
            pI2cDescriptor->xSemphr = xSemaphoreCreateBinary();

            /* If semaphore creation fails, set returned handle to NULL. */
            if( pI2cDescriptor->xSemphr == NULL )
            {
                pI2cDescriptor = NULL;
            }
        }
        else
        {
            /* In failure case, set returned handle to NULL. */
            pI2cDescriptor = NULL;
        }
    }
    else
    {
        /* Return NULL handle if opened more than once. */
        pI2cDescriptor = NULL;
    }

    if( pI2cDescriptor != NULL )
    {
        /* Set opened flag. */
        pI2cDescriptor->flags |= _FLAG_OPENED;
    }

    return pI2cDescriptor;
}

void iot_i2c_set_callback( IotI2CHandle_t const pxI2CPeripheral,
                           IotI2CCallback_t xCallback,
                           void * pvUserContext )
{
    IotI2CDescriptor_t * pI2cDescriptor = pxI2CPeripheral;

    /* Silently returns if input handle is invalid. */
    if( ( pI2cDescriptor == NULL ) || ( ( pI2cDescriptor->flags & _FLAG_OPENED ) == 0 ) )
    {
        return;
    }

    pI2cDescriptor->xCallback = xCallback;
    pI2cDescriptor->pvUserContext = pvUserContext;
}

int32_t iot_i2c_read_sync( IotI2CHandle_t const pxI2CPeripheral,
                           uint8_t * const pucBuffer,
                           size_t xBytes )
{
    IotI2CDescriptor_t * pI2cDescriptor = pxI2CPeripheral;
    HAL_StatusTypeDef halStatus = HAL_OK;

    if( ( pI2cDescriptor == NULL ) ||
        ( _isFlagNotSet( pI2cDescriptor, _FLAG_OPENED ) ) ||
        ( pucBuffer == NULL ) ||
        ( xBytes == 0 ) )
    {
        return IOT_I2C_INVALID_VALUE;
    }

    if( _isFlagNotSet( pI2cDescriptor, _FLAG_SLAVE_ADDRESS ) )
    {
        return IOT_I2C_SLAVE_ADDRESS_NOT_SET;
    }

    /* Initialize with the requested number of bytes. */
    pI2cDescriptor->usReceivedRxBytes = xBytes;

    halStatus = _doMasterTransfer( pI2cDescriptor, pucBuffer, xBytes, HAL_I2C_Master_Receive, NULL, HAL_I2C_Master_Sequential_Receive_IT );

    return _toI2cStatus( halStatus, _I2C_READ_OP );
}

int32_t iot_i2c_write_sync( IotI2CHandle_t const pxI2CPeripheral,
                            uint8_t * const pucBuffer,
                            size_t xBytes )
{
    IotI2CDescriptor_t * pI2cDescriptor = pxI2CPeripheral;
    HAL_StatusTypeDef halStatus = HAL_OK;

    if( ( pI2cDescriptor == NULL ) ||
        ( _isFlagNotSet( pI2cDescriptor, _FLAG_OPENED ) ) ||
        ( pucBuffer == NULL ) ||
        ( xBytes == 0 ) )
    {
        return IOT_I2C_INVALID_VALUE;
    }

    if( _isFlagNotSet( pI2cDescriptor, _FLAG_SLAVE_ADDRESS ) )
    {
        return IOT_I2C_SLAVE_ADDRESS_NOT_SET;
    }

    /* Initialize with the requested number of bytes. */
    pI2cDescriptor->usTransmittedTxBytes = xBytes;

    halStatus = _doMasterTransfer( pI2cDescriptor, pucBuffer, xBytes, HAL_I2C_Master_Transmit, NULL, HAL_I2C_Master_Sequential_Transmit_IT );

    return _toI2cStatus( halStatus, _I2C_WRITE_OP );
}

int32_t iot_i2c_read_async( IotI2CHandle_t const pxI2CPeripheral,
                            uint8_t * const pucBuffer,
                            size_t xBytes )
{
    IotI2CDescriptor_t * pI2cDescriptor = pxI2CPeripheral;
    HAL_StatusTypeDef halStatus = HAL_OK;

    if( ( pI2cDescriptor == NULL ) ||
        ( _isFlagNotSet( pI2cDescriptor, _FLAG_OPENED ) ) ||
        ( pucBuffer == NULL ) ||
        ( xBytes == 0 ) )
    {
        return IOT_I2C_INVALID_VALUE;
    }

    if( _isFlagNotSet( pI2cDescriptor, _FLAG_SLAVE_ADDRESS ) )
    {
        return IOT_I2C_SLAVE_ADDRESS_NOT_SET;
    }

    /* Initialize with the requested number of bytes. */
    pI2cDescriptor->usReceivedRxBytes = xBytes;

    halStatus = _doMasterTransfer( pI2cDescriptor, pucBuffer, xBytes, NULL, HAL_I2C_Master_Receive_IT, HAL_I2C_Master_Sequential_Receive_IT );

    return _toI2cStatus( halStatus, _I2C_READ_OP );
}

int32_t iot_i2c_write_async( IotI2CHandle_t const pxI2CPeripheral,
                             uint8_t * const pucBuffer,
                             size_t xBytes )
{
    IotI2CDescriptor_t * pI2cDescriptor = pxI2CPeripheral;
    HAL_StatusTypeDef halStatus = HAL_OK;

    if( ( pI2cDescriptor == NULL ) ||
        ( _isFlagNotSet( pI2cDescriptor, _FLAG_OPENED ) ) ||
        ( pucBuffer == NULL ) ||
        ( xBytes == 0 ) )
    {
        return IOT_I2C_INVALID_VALUE;
    }

    if( _isFlagNotSet( pI2cDescriptor, _FLAG_SLAVE_ADDRESS ) )
    {
        return IOT_I2C_SLAVE_ADDRESS_NOT_SET;
    }

    /* Initialize with the requested number of bytes. */
    pI2cDescriptor->usTransmittedTxBytes = xBytes;

    halStatus = _doMasterTransfer( pI2cDescriptor, pucBuffer, xBytes, NULL, HAL_I2C_Master_Transmit_IT, HAL_I2C_Master_Sequential_Transmit_IT );

    return _toI2cStatus( halStatus, _I2C_WRITE_OP );
}

int32_t iot_i2c_cancel( IotI2CHandle_t const pxI2CPeripheral )
{
    /* IotI2CDescriptor_t * pI2cDescriptor = pxI2CPeripheral;
     *
     * if( ( pI2cDescriptor == NULL ) ||
     *  ( _isFlagNotSet( pI2cDescriptor, _FLAG_OPENED ) ) )
     * {
     *  return IOT_I2C_INVALID_VALUE;
     * }
     *
     * if( pxI2CPeripheral->xHandle.State == HAL_I2C_STATE_READY )
     * {
     *  return IOT_I2C_NOTHING_TO_CANCEL;
     * } */

    /* TODO: after write_async or read_async, calling HAL_I2C_Master_Abort_IT immediately will leave the bus in a weird state,
     * so that any operation afterwards will return timeout or error.
     */
    return IOT_I2C_FUNCTION_NOT_SUPPORTED;
}

int32_t iot_i2c_ioctl( IotI2CHandle_t const pxI2CPeripheral,
                       IotI2CIoctlRequest_t xI2CRequest,
                       void * const pvBuffer )
{
    int32_t status = IOT_I2C_SUCCESS;
    IotI2CDescriptor_t * pI2cDescriptor = pxI2CPeripheral;

