aws/amazon-freertos/vendors/st/boards/stm32l475_discovery/ports/common_io/iot_i2c.c
    xSemaphoreGiveFromISR( pDescriptor->xSemphr, &higherPriorityTaskWoken );
    portYIELD_FROM_ISR( higherPriorityTaskWoken );
}

void HAL_I2C_ErrorCallback( I2C_HandleTypeDef * hi2c )
{
    IotI2CDescriptor_t * pDescriptor = _toDescriptor( hi2c );
    BaseType_t higherPriorityTaskWoken = pdFALSE;

    if( pDescriptor->xCallback != NULL )
    {
        pDescriptor->xCallback( eI2CCompleted, pDescriptor->pvUserContext );
    }

    xSemaphoreGiveFromISR( pDescriptor->xSemphr, &higherPriorityTaskWoken );
    portYIELD_FROM_ISR( higherPriorityTaskWoken );
}

/*---------------------Private functions---------------------*/

static int32_t _toI2cStatus( HAL_StatusTypeDef halStatus,
                             uint8_t operation )
{
    switch( halStatus )
    {
        case HAL_OK:
            return IOT_I2C_SUCCESS;

        case HAL_ERROR:
            return operation == _I2C_READ_OP ? IOT_I2C_READ_FAILED : IOT_I2C_WRITE_FAILED;

        case HAL_BUSY:
            return IOT_I2C_BUSY;

        case HAL_TIMEOUT:
            return IOT_I2C_BUS_TIMEOUT;
    }

    /* TODO: it is better to assert(0) here. */
    return IOT_I2C_SUCCESS;
}

static int32_t _doMasterTransfer( IotI2CDescriptor_t * pI2cDescriptor,
                                  uint8_t * const pucBuffer,
                                  size_t xBytes,
                                  HAL_StatusTypeDef ( * pMasterSync )( I2C_HandleTypeDef * hi2c,
                                                                       uint16_t DevAddress,
                                                                       uint8_t * pData,
                                                                       uint16_t Size,
                                                                       uint32_t Timeout ),
                                  HAL_StatusTypeDef ( * pMasterIT )( I2C_HandleTypeDef * hi2c,
                                                                     uint16_t DevAddress,
                                                                     uint8_t * pData,
                                                                     uint16_t Size ),
                                  HAL_StatusTypeDef ( * pMasterSequentialIT )( I2C_HandleTypeDef * hi2c,
                                                                               uint16_t DevAddress,
                                                                               uint8_t * pData,
                                                                               uint16_t Size,
                                                                               uint32_t XferOptions ) )
{
    HAL_StatusTypeDef halStatus = HAL_OK;
    uint8_t ucAsyncCall = 1;

    uint8_t ongoingTrans = ( pI2cDescriptor->xHandle.PreviousState & _I2C_STATE_BUSY_MASK ) > 0;

    /* Do not send stop condition. */
    if( _isFlagSet( pI2cDescriptor, _FLAG_NO_STOP ) )
    {
        /* If the previous state is ready, then there is no ongoing transaction; otherwise, there is. */
        halStatus = pMasterSequentialIT( &( pI2cDescriptor->xHandle ), pI2cDescriptor->usSlaveAddr, pucBuffer, xBytes, ongoingTrans ? I2C_NEXT_FRAME : I2C_FIRST_FRAME );

        /* Clear no stop flag. */
        pI2cDescriptor->flags &= ~_FLAG_NO_STOP;
    }
    else
    {
        if( ongoingTrans )
        {
            /* There is an ongoing transaction; end the transaction. */
            halStatus = pMasterSequentialIT( &( pI2cDescriptor->xHandle ), pI2cDescriptor->usSlaveAddr, pucBuffer, xBytes, I2C_LAST_FRAME );
        }
        else
        {
            if( pMasterSync != NULL )
            {
                /* No ongoing transaction; simply make a blocking call. */
                halStatus = pMasterSync( &( pI2cDescriptor->xHandle ), pI2cDescriptor->usSlaveAddr, pucBuffer, xBytes, pI2cDescriptor->xConfig.ulMasterTimeout );

                /* No async call is made. */
                ucAsyncCall = 0;
            }
            else
            {
                /* No ongoing transaction; simple make a interrupted call. */
                halStatus = pMasterIT( &( pI2cDescriptor->xHandle ), pI2cDescriptor->usSlaveAddr, pucBuffer, xBytes );
            }
        }
    }

    /* An async driver call has been made so it must wait for the callback before return,
     * only if the transfer has succeeded and this comes from a sync API call. */
    if( ( halStatus == HAL_OK ) && ( pMasterSync != NULL ) && ( ucAsyncCall == 1 ) )
    {
        if( xSemaphoreTake( pI2cDescriptor->xSemphr, pdMS_TO_TICKS( pI2cDescriptor->xConfig.ulMasterTimeout ) ) == pdFALSE )
        {
            /* If callback is not invoked with timeout, return timeout. */
            halStatus = HAL_TIMEOUT;
        }
    }

    return halStatus;
}
